# 1) У вас есть список my_list с значениями типа int.
# Распечатать те значения, которые больше 100.
# Задание выполнить с помощью цикла for.


my_list1 = [1 for in range(20)]
print(my_list1)